; domain
;; Specification in PDDL1 of the DWR domain

(define (domain dock-worker-robot-pos)
 (:requirements :strips :typing )
 (:types 
  location      ; there are several connected locations in the harbor 
  pile             ; is attached to a location 
                     ; it holds a pallet and a stack of containers 
  robot          ; holds at most 1 container, only 1 robot per location
  crane          ; belongs to a location to pickup containers
  container)

 (:constants
  pallet - container)

 (:predicates
   (adjacent ?l1  ?l2 - location)       ; location ?l1 is adjacent ot ?l2
   (attached ?p - pile ?l - location)  ; pile ?p attached to location ?l
   (belong ?k - crane ?l - location)   ; crane ?k belongs to location ?l

   (atl ?r - robot ?l - location)       ; robot ?r is at location ?l
   (free ?l - location)             ; there is a robot at location ?l
   (loaded ?r - robot ?c - container ) ; robot ?r is loaded with container ?c
   (unloaded ?r - robot)                 ; robot ?r is empty

   (holding ?k - crane ?c - container) ; crane ?k is holding a container ?c
   (empty ?k - crane)                          ; crane ?k is empty

   (in ?c - container ?p - pile)        ; container ?c is within pile ?p
   (top ?c - container ?p - pile)      ;  container ?c is on top of pile ?p
   (on ?k1 - container ?k2 - container); container ?k1 is on container ?k2
   )

;; there are 5 operators in this domain:

;; moves a robot between two adjacent locations
 (:action move                                
     :parameters (?r - robot ?from ?to - location)
     :precondition (and (adjacent ?from ?to)
                      (atl ?r ?from) (free ?to))
     :effect (and (atl ?r ?to) (free ?from)
		                (not (free ?to)) (not (atl ?r ?from)) ))

;; loads an empty robot with a container held by a nearby crane
 (:action load                                
     :parameters (?k - crane ?l - location ?c - container ?r - robot)
     :precondition (and (atl ?r ?l) (belong ?k ?l)
                      (holding ?k ?c) (unloaded ?r))
     :effect (and  (loaded ?r ?c) (not (unloaded ?r))
                  (empty ?k) (not (holding ?k ?c))))


;; unloads a robot holding a container with a nearby crane
 (:action unload                                 
     :parameters (?k - crane ?l - location ?c - container ?r - robot)
     :precondition (and (belong ?k ?l) (atl ?r ?l)
                      (loaded ?r ?c) (empty ?k))
     :effect (and (unloaded ?r) (holding ?k ?c)
                (not (loaded ?r ?c))(not (empty ?k))))

;; takes a container from a pile with a crane
 (:action take
     :parameters (?k - crane ?l - location ?c ?else - container ?p - pile)
     :precondition (and (belong ?k ?l)(attached ?p ?l)
                       (empty ?k) (in ?c ?p) 
                       (top ?c ?p) (on ?c ?else))
     :effect (and (holding ?k ?c) (top ?else ?p)
                (not (in ?c ?p)) (not (top ?c ?p))
                (not (on ?c ?else)) (not (empty ?k))))

;; puts a container held by a crane on a nearby pile
 (:action put                                 
     :parameters (?k - crane ?l - location ?c ?else - container ?p - pile)
     :precondition (and (belong ?k ?l) (attached ?p ?l)
                      (holding ?k ?c) (top ?else ?p))
     :effect (and (in ?c ?p) (top ?c ?p) (on ?c ?else)
                 (not (top ?else ?p)) (not (holding ?k ?c))
                 (empty ?k))))

; problem
(define (problem dwrpb1)
  (:domain dock-worker-robot-pos)

  (:objects
   r1 - robot
   l1 l2 - location
   k1 k2 - crane
   p1 q1 p2 q2 - pile
   ca cb cc cd ce cf - container)

  (:init
   (adjacent l1 l2) (adjacent l2 l1)

   (attached p1 l1)(attached q1 l1)(attached p2 l2)(attached q2 l2)

   (belong k1 l1)(belong k2 l2)

   (in ca p1)(in cb p1)(in cc p1)(in cd q1)(in ce q1) (in cf q1)

   (on ca pallet)(on cb ca)(on cc cb) (on cd pallet) (on ce cd) (on cf ce)

   (top cc p1)  (top cf q1)  (top pallet p2) (top pallet q2)

   (atl r1 l1)
   (unloaded r1)
   (free l2)

   (empty k1)
   (empty k2))

;; the task is to move all containers to locations l2
;; ca and cc in pile p2, the rest in q2
  (:goal
    (and (in ca p2)
         (in cb q2)
         (in cc p2)
         (in cd q2)
         (in ce q2)
         (in cf q2))))

; plan
1. (take k1 l1 cc cb p1)
   deleted: (in cc p1) (top cc p1) (on cc cb) (empty k1)
   added: (holding k1 cc) (top cb p1)
   goals met: 0 of 6
2. (load k1 l1 cc r1)
   deleted: (unloaded r1) (holding k1 cc)
   added: (loaded r1 cc) (empty k1)
   goals met: 0 of 6
3. (move r1 l1 l2)
   deleted: (free l2) (atl r1 l1)
   added: (atl r1 l2) (free l1)
   goals met: 0 of 6
4. (unload k2 l2 cc r1)
   deleted: (loaded r1 cc) (empty k2)
   added: (unloaded r1) (holding k2 cc)
   goals met: 0 of 6
5. (put k2 l2 cc pallet p2)
   deleted: (top pallet p2) (holding k2 cc)
   added: (in cc p2) (top cc p2) (on cc pallet) (empty k2)
   goals met: 1 of 6
6. (take k1 l1 cb ca p1)
   deleted: (in cb p1) (top cb p1) (on cb ca) (empty k1)
   added: (holding k1 cb) (top ca p1)
   goals met: 1 of 6
7. (move r1 l2 l1)
   deleted: (free l1) (atl r1 l2)
   added: (atl r1 l1) (free l2)
   goals met: 1 of 6
8. (load k1 l1 cb r1)
   deleted: (unloaded r1) (holding k1 cb)
   added: (loaded r1 cb) (empty k1)
   goals met: 1 of 6
9. (move r1 l1 l2)
   deleted: (free l2) (atl r1 l1)
   added: (atl r1 l2) (free l1)
   goals met: 1 of 6
10. (unload k2 l2 cb r1)
   deleted: (loaded r1 cb) (empty k2)
   added: (unloaded r1) (holding k2 cb)
   goals met: 1 of 6
11. (put k2 l2 cb pallet q2)
   deleted: (top pallet q2) (holding k2 cb)
   added: (in cb q2) (top cb q2) (on cb pallet) (empty k2)
   goals met: 2 of 6
12. (take k1 l1 cf ce q1)
   deleted: (in cf q1) (top cf q1) (on cf ce) (empty k1)
   added: (holding k1 cf) (top ce q1)
   goals met: 2 of 6
13. (move r1 l2 l1)
   deleted: (free l1) (atl r1 l2)
   added: (atl r1 l1) (free l2)
   goals met: 2 of 6
14. (load k1 l1 cf r1)
   deleted: (unloaded r1) (holding k1 cf)
   added: (loaded r1 cf) (empty k1)
   goals met: 2 of 6
15. (move r1 l1 l2)
   deleted: (free l2) (atl r1 l1)
   added: (atl r1 l2) (free l1)
   goals met: 2 of 6
16. (unload k2 l2 cf r1)
   deleted: (loaded r1 cf) (empty k2)
   added: (unloaded r1) (holding k2 cf)
   goals met: 2 of 6
17. (put k2 l2 cf cb q2)
   deleted: (top cb q2) (holding k2 cf)
   added: (in cf q2) (top cf q2) (on cf cb) (empty k2)
   goals met: 3 of 6
18. (take k1 l1 ce cd q1)
   deleted: (in ce q1) (top ce q1) (on ce cd) (empty k1)
   added: (holding k1 ce) (top cd q1)
   goals met: 3 of 6
19. (move r1 l2 l1)
   deleted: (free l1) (atl r1 l2)
   added: (atl r1 l1) (free l2)
   goals met: 3 of 6
20. (load k1 l1 ce r1)
   deleted: (unloaded r1) (holding k1 ce)
   added: (loaded r1 ce) (empty k1)
   goals met: 3 of 6
21. (move r1 l1 l2)
   deleted: (free l2) (atl r1 l1)
   added: (atl r1 l2) (free l1)
   goals met: 3 of 6
22. (unload k2 l2 ce r1)
   deleted: (loaded r1 ce) (empty k2)
   added: (unloaded r1) (holding k2 ce)
   goals met: 3 of 6
23. (put k2 l2 ce cf q2)
   deleted: (top cf q2) (holding k2 ce)
   added: (in ce q2) (top ce q2) (on ce cf) (empty k2)
   goals met: 4 of 6
24. (move r1 l2 l1)
   deleted: (free l1) (atl r1 l2)
   added: (atl r1 l1) (free l2)
   goals met: 4 of 6
25. (take k1 l1 ca pallet p1)
   deleted: (in ca p1) (top ca p1) (on ca pallet) (empty k1)
   added: (holding k1 ca) (top pallet p1)
   goals met: 4 of 6
26. (load k1 l1 ca r1)
   deleted: (unloaded r1) (holding k1 ca)
   added: (loaded r1 ca) (empty k1)
   goals met: 4 of 6
27. (move r1 l1 l2)
   deleted: (free l2) (atl r1 l1)
   added: (atl r1 l2) (free l1)
   goals met: 4 of 6
28. (unload k2 l2 ca r1)
   deleted: (loaded r1 ca) (empty k2)
   added: (unloaded r1) (holding k2 ca)
   goals met: 4 of 6
29. (take k1 l1 cd pallet q1)
   deleted: (in cd q1) (top cd q1) (on cd pallet) (empty k1)
   added: (holding k1 cd) (top pallet q1)
   goals met: 4 of 6
30. (put k2 l2 ca cc p2)
   deleted: (top cc p2) (holding k2 ca)
   added: (in ca p2) (top ca p2) (on ca cc) (empty k2)
   goals met: 5 of 6
31. (move r1 l2 l1)
   deleted: (free l1) (atl r1 l2)
   added: (atl r1 l1) (free l2)
   goals met: 5 of 6
32. (load k1 l1 cd r1)
   deleted: (unloaded r1) (holding k1 cd)
   added: (loaded r1 cd) (empty k1)
   goals met: 5 of 6
33. (move r1 l1 l2)
   deleted: (free l2) (atl r1 l1)
   added: (atl r1 l2) (free l1)
   goals met: 5 of 6
34. (unload k2 l2 cd r1)
   deleted: (loaded r1 cd) (empty k2)
   added: (unloaded r1) (holding k2 cd)
   goals met: 5 of 6
35. (put k2 l2 cd ce q2)
   deleted: (top ce q2) (holding k2 cd)
   added: (in cd q2) (top cd q2) (on cd ce) (empty k2)
   goals met: 6 of 6
